       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOEC1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS CERR1
           CLASS CSUB1
           CLASS COTH1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 E USAGE OBJECT REFERENCE CSUB1.
       01 U USAGE OBJECT REFERENCE.
       PROCEDURE DIVISION.
       DECLARATIVES.
       OTH-SEC SECTION.
           USE AFTER EXCEPTION OBJECT COTH1.
       OTH-P.
           DISPLAY "WRONG-HANDLER".
       BASE-SEC SECTION.
           USE AFTER EO CERR1.
       BASE-P.
           DISPLAY "BASE-HANDLER " FUNCTION EXCEPTION-STATUS.
           SET U TO EXCEPTION-OBJECT.
           IF U NOT = NULL DISPLAY "REGISTER-SET" END-IF.
       END DECLARATIVES.
       MAIN SECTION.
       MAIN-P.
           INVOKE CSUB1 "NEW" RETURNING E.
           RAISE E.
           DISPLAY "AFTER-RAISE".
           STOP RUN.
       END PROGRAM OOEC1.

       IDENTIFICATION DIVISION.
       CLASS-ID. CERR1.
       END CLASS CERR1.

       IDENTIFICATION DIVISION.
       CLASS-ID. CSUB1 INHERITS FROM CERR1.
       END CLASS CSUB1.

       IDENTIFICATION DIVISION.
       CLASS-ID. COTH1.
       END CLASS COTH1.
