       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOEC2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS CERR2
           CLASS CSVC2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 S USAGE OBJECT REFERENCE CSVC2.
       01 R PIC 9(4).
       PROCEDURE DIVISION.
       DECLARATIVES.
       ERR-SEC SECTION.
           USE AFTER EXCEPTION OBJECT CERR2.
       ERR-P.
           DISPLAY "HANDLED R=" R.
       END DECLARATIVES.
       MAIN SECTION.
       MAIN-P.
           INVOKE CSVC2 "NEW" RETURNING S.
           INVOKE S "WORK" RETURNING R.
           DISPLAY "AFTER-INVOKE R=" R.
           STOP RUN.
       END PROGRAM OOEC2.

       IDENTIFICATION DIVISION.
       CLASS-ID. CERR2.
       END CLASS CERR2.

       IDENTIFICATION DIVISION.
       CLASS-ID. CSVC2.
       IDENTIFICATION DIVISION.
       OBJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 W-E USAGE OBJECT REFERENCE CERR2.
       PROCEDURE DIVISION.
       METHOD-ID. WORK.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-R PIC 9(4).
       PROCEDURE DIVISION RETURNING LK-R RAISING CERR2.
       MAIN.
           MOVE 77 TO LK-R.
           INVOKE CERR2 "NEW" RETURNING W-E.
           GOBACK RAISING W-E.
       END METHOD WORK.
       END OBJECT.
       END CLASS CSVC2.
