       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOFAC1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS FANI.
           CLASS FDOG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A USAGE OBJECT REFERENCE FANI.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE FANI "BUMP".
           INVOKE FANI "BUMP".
           INVOKE FDOG "BUMP".
           INVOKE FANI "SHOW".
           INVOKE FDOG "SHOW".
           INVOKE FDOG "MAKE" RETURNING A.
           INVOKE A "SPEAK".
           STOP RUN.
       END PROGRAM OOFAC1.

       IDENTIFICATION DIVISION.
       CLASS-ID. FANI.
       IDENTIFICATION DIVISION.
       FACTORY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FC PIC 9(2) VALUE 0.
       PROCEDURE DIVISION.
       METHOD-ID. BUMP.
       PROCEDURE DIVISION.
       MAIN.
           ADD 1 TO FC.
       END METHOD BUMP.
       METHOD-ID. SHOW.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "FC=" FC.
       END METHOD SHOW.
       METHOD-ID. MAKE.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-O USAGE OBJECT REFERENCE FANI.
       PROCEDURE DIVISION RETURNING LK-O.
       MAIN.
           INVOKE SELF "NEW" RETURNING LK-O.
       END METHOD MAKE.
       END FACTORY.
       IDENTIFICATION DIVISION.
       OBJECT.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "GENERIC".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS FANI.

       IDENTIFICATION DIVISION.
       CLASS-ID. FDOG INHERITS FROM FANI.
       IDENTIFICATION DIVISION.
       OBJECT.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK OVERRIDE.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "WOOF".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS FDOG.
