       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOIF3.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS CANI3.
           CLASS CDOG3.
           CLASS CFAC3.
           INTERFACE IMKR3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 M USAGE OBJECT REFERENCE IMKR3.
       01 A USAGE OBJECT REFERENCE CANI3.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE CFAC3 "NEW" RETURNING M.
           INVOKE M "MAKE" RETURNING A.
           INVOKE A "SPEAK".
           STOP RUN.
       END PROGRAM OOIF3.

       IDENTIFICATION DIVISION.
       INTERFACE-ID. IMKR3.
       PROCEDURE DIVISION.
       METHOD-ID. MAKE.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-R USAGE OBJECT REFERENCE CANI3.
       PROCEDURE DIVISION RETURNING LK-R.
       END METHOD MAKE.
       END INTERFACE IMKR3.

       IDENTIFICATION DIVISION.
       CLASS-ID. CANI3.
       IDENTIFICATION DIVISION.
       OBJECT.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "GENERIC".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS CANI3.

       IDENTIFICATION DIVISION.
       CLASS-ID. CDOG3 INHERITS FROM CANI3.
       IDENTIFICATION DIVISION.
       OBJECT.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK OVERRIDE.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "WOOF".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS CDOG3.

       IDENTIFICATION DIVISION.
       CLASS-ID. CFAC3.
       IDENTIFICATION DIVISION.
       OBJECT. IMPLEMENTS IMKR3.
       PROCEDURE DIVISION.
       METHOD-ID. MAKE.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-D USAGE OBJECT REFERENCE CDOG3.
       PROCEDURE DIVISION RETURNING LK-D.
       MAIN.
           INVOKE CDOG3 "NEW" RETURNING LK-D.
       END METHOD MAKE.
       END OBJECT.
       END CLASS CFAC3.
