       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOIF1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS ICAT.
           CLASS IDOG.
           INTERFACE ISPKR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 S USAGE OBJECT REFERENCE ISPKR.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE ICAT "NEW" RETURNING S.
           INVOKE S "SPEAK".
           INVOKE IDOG "NEW" RETURNING S.
           INVOKE S "SPEAK".
           STOP RUN.
       END PROGRAM OOIF1.

       IDENTIFICATION DIVISION.
       INTERFACE-ID. ISPKR.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK.
       PROCEDURE DIVISION.
       END METHOD SPEAK.
       END INTERFACE ISPKR.

       IDENTIFICATION DIVISION.
       CLASS-ID. ICAT.
       IDENTIFICATION DIVISION.
       OBJECT. IMPLEMENTS ISPKR.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "MEOW".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS ICAT.

       IDENTIFICATION DIVISION.
       CLASS-ID. IDOG.
       IDENTIFICATION DIVISION.
       OBJECT. IMPLEMENTS ISPKR.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "WOOF".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS IDOG.
