       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOPRF1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS CACC7.
           PROPERTY BAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A USAGE OBJECT REFERENCE CACC7.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE CACC7 "NEW" RETURNING A.
           DISPLAY BAL OF A.
           MOVE 555 TO BAL OF A.
           DISPLAY BAL OF A.
           ADD 20 TO BAL OF A.
           DISPLAY BAL OF A.
           STOP RUN.
       END PROGRAM OOPRF1.

       IDENTIFICATION DIVISION.
       CLASS-ID. CACC7.
       IDENTIFICATION DIVISION.
       OBJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BAL PIC 9(5) VALUE 100 PROPERTY.
       PROCEDURE DIVISION.
       END OBJECT.
       END CLASS CACC7.
