       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOPR3.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS CACC3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A USAGE OBJECT REFERENCE CACC3.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE CACC3 "NEW" RETURNING A.
           INVOKE A "PING".
           STOP RUN.
       END PROGRAM OOPR3.

       IDENTIFICATION DIVISION.
       CLASS-ID. CACC3.
       IDENTIFICATION DIVISION.
       OBJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 W-BAL PIC 9(5) VALUE 7.
       PROCEDURE DIVISION.
       METHOD-ID. GET PROPERTY BAL.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-R PIC 9(5).
       PROCEDURE DIVISION RETURNING LK-R.
       MAIN.
           MOVE W-BAL TO LK-R.
       END METHOD.
       METHOD-ID. SET PROPERTY BAL.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-V PIC 9(5).
       PROCEDURE DIVISION USING LK-V.
       MAIN.
           MOVE LK-V TO W-BAL.
       END METHOD.
       METHOD-ID. PING.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "ACCESSORS-OK " W-BAL.
       END METHOD PING.
       END OBJECT.
       END CLASS CACC3.
