       IDENTIFICATION DIVISION.
       PROGRAM-ID. OOUV5.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS CUV5B.
           CLASS CUV5D.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 U USAGE OBJECT REFERENCE.
       01 D USAGE OBJECT REFERENCE CUV5D.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE CUV5D "NEW" RETURNING D.
           SET U TO D.
           INVOKE U "HELLO".
           INVOKE U "SPEAK".
           STOP RUN.
       END PROGRAM OOUV5.

       IDENTIFICATION DIVISION.
       CLASS-ID. CUV5B.
       IDENTIFICATION DIVISION.
       OBJECT.
       PROCEDURE DIVISION.
       METHOD-ID. HELLO.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "HELLO-FROM-BASE".
       END METHOD HELLO.
       METHOD-ID. SPEAK.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "BASE-VOICE".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS CUV5B.

       IDENTIFICATION DIVISION.
       CLASS-ID. CUV5D INHERITS FROM CUV5B.
       IDENTIFICATION DIVISION.
       OBJECT.
       PROCEDURE DIVISION.
       METHOD-ID. SPEAK OVERRIDE.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "DERIVED-VOICE".
       END METHOD SPEAK.
       END OBJECT.
       END CLASS CUV5D.
