       IDENTIFICATION DIVISION.
       PROGRAM-ID. F3.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F ASSIGN TO "nonexist-zz.dat" ORGANIZATION SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR PIC X(4).
       PROCEDURE DIVISION.
       DECLARATIVES.
       D1 SECTION.
           USE AFTER STANDARD ERROR PROCEDURE ON F.
           DISPLAY "IN USE".
       END DECLARATIVES.
       M SECTION.
           OPEN INPUT F.
           DISPLAY "AFTER OPEN".
           STOP RUN.
