       IDENTIFICATION DIVISION.
       PROGRAM-ID. F7.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F ASSIGN TO "f7out.txt" ORGANIZATION LINE SEQUENTIAL FILE STATUS ST.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FR PIC X(4).
       WORKING-STORAGE SECTION.
       01 ST PIC XX.
       PROCEDURE DIVISION.
           OPEN OUTPUT F.
           MOVE X"41014243" TO FR.
           WRITE FR.
           DISPLAY "AFTER WRITE " ST.
           CLOSE F.
           STOP RUN.
