       IDENTIFICATION DIVISION.
       PROGRAM-ID. G1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 S PIC 9(3) VALUE 42.
       PROCEDURE DIVISION.
           DISPLAY "HI".
           GOBACK WITH ERROR STATUS S.
