       IDENTIFICATION DIVISION.
       PROGRAM-ID. G5.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 S PIC 9(3) VALUE 42.
       PROCEDURE DIVISION.
           DISPLAY "HI".
           STOP RUN WITH ERROR STATUS S.
