       IDENTIFICATION DIVISION.
       PROGRAM-ID. GC1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS WCLS
           CLASS JCLS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MFILE ASSIGN TO "gc.dat" FILE STATUS MS.
           SELECT DUMMY ASSIGN TO "gcdummy.dat" FILE STATUS DS.
       DATA DIVISION.
       FILE SECTION.
       FD MFILE.
       01 MREC PIC X(3).
       FD DUMMY.
       01 DREC PIC X(3).
       WORKING-STORAGE SECTION.
       01 A USAGE OBJECT REFERENCE WCLS.
       01 J USAGE OBJECT REFERENCE JCLS.
       01 MS PIC XX.
       01 DS PIC XX.
       01 I PIC 9(8) COMP.
       01 K PIC 9(8) COMP.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE WCLS "NEW" RETURNING A.
           INVOKE A "W".
           SET A TO NULL.
           PERFORM VARYING K FROM 1 BY 1 UNTIL K > 20
             PERFORM VARYING I FROM 1 BY 1 UNTIL I > 200000
               INVOKE JCLS "NEW" RETURNING J
             END-PERFORM
             OPEN OUTPUT DUMMY
             CLOSE DUMMY
           END-PERFORM.
           OPEN INPUT MFILE.
           DISPLAY "OPEN=" MS.
           READ MFILE AT END DISPLAY "EOF".
           DISPLAY "READ=" MS " REC=" MREC.
           CLOSE MFILE.
           STOP RUN.
       END PROGRAM GC1.

       IDENTIFICATION DIVISION.
       CLASS-ID. JCLS.
       IDENTIFICATION DIVISION.
       OBJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X(200).
       PROCEDURE DIVISION.
       END OBJECT.
       END CLASS JCLS.

       IDENTIFICATION DIVISION.
       CLASS-ID. WCLS.
       IDENTIFICATION DIVISION.
       OBJECT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OFILE ASSIGN TO "gc.dat".
       DATA DIVISION.
       FILE SECTION.
       FD OFILE.
       01 OFILE-REC PIC X(3).
       PROCEDURE DIVISION.
       METHOD-ID. W.
       PROCEDURE DIVISION.
       MAIN.
           OPEN OUTPUT OFILE.
           MOVE "AAA" TO OFILE-REC.
           WRITE OFILE-REC.
       END METHOD W.
       END OBJECT.
       END CLASS WCLS.
