       IDENTIFICATION DIVISION.
       PROGRAM-ID. GC2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS WCLS
           CLASS JCLS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MFILE ASSIGN TO "gc.dat" FILE STATUS MS.
           SELECT DUMMY ASSIGN TO "gcdummy.dat" FILE STATUS DS.
       DATA DIVISION.
       FILE SECTION.
       FD MFILE.
       01 MREC PIC X(3).
       FD DUMMY.
       01 DREC PIC X(3).
       WORKING-STORAGE SECTION.
       01 A USAGE OBJECT REFERENCE WCLS.
       01 J USAGE OBJECT REFERENCE JCLS.
       01 MS PIC XX.
       01 DS PIC XX.
       01 I PIC 9(8) COMP.
       01 K PIC 9(8) COMP.
       PROCEDURE DIVISION.
       MAIN.
           PERFORM VARYING K FROM 1 BY 1 UNTIL K > 3
             INVOKE WCLS "NEW" RETURNING A
             INVOKE A "W" RETURNING MS
             IF MS NOT = "00" DISPLAY "K=" K " OPEN-OUTPUT=" MS
                STOP RUN
             END-IF
             SET A TO NULL
             PERFORM VARYING I FROM 1 BY 1 UNTIL I > 1500000
               INVOKE JCLS "NEW" RETURNING J
             END-PERFORM
           END-PERFORM.
           DISPLAY "ALL 3000 OK".
           STOP RUN.
       END PROGRAM GC2.

       IDENTIFICATION DIVISION.
       CLASS-ID. JCLS.
       IDENTIFICATION DIVISION.
       OBJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X(200).
       PROCEDURE DIVISION.
       END OBJECT.
       END CLASS JCLS.

       IDENTIFICATION DIVISION.
       CLASS-ID. WCLS.
       IDENTIFICATION DIVISION.
       OBJECT.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OFILE ASSIGN TO "gc.dat" FILE STATUS OS.
       DATA DIVISION.
       FILE SECTION.
       FD OFILE.
       01 OFILE-REC PIC X(3).
       WORKING-STORAGE SECTION.
       01 OS PIC XX.
       PROCEDURE DIVISION.
       METHOD-ID. W.
       DATA DIVISION.
       LINKAGE SECTION.
       01 RS PIC XX.
       PROCEDURE DIVISION RETURNING RS.
       MAIN.
           OPEN OUTPUT OFILE.
           IF OS NOT = "00" MOVE OS TO RS GOBACK END-IF.
           MOVE "AAA" TO OFILE-REC.
           WRITE OFILE-REC.
           MOVE OS TO RS.
       END METHOD W.
       END OBJECT.
       END CLASS WCLS.
