       IDENTIFICATION DIVISION.
       PROGRAM-ID. H1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC X(2) VALUE X"80FF".
       01 N PIC N(1) VALUE NX"D800".
       01 N2 PIC N(1) VALUE NX"FFFF".
       PROCEDURE DIVISION.
           DISPLAY FUNCTION ORD(A(1:1)) " " FUNCTION ORD(A(2:1)).
           DISPLAY FUNCTION LENGTH(NX"D800") " " FUNCTION LENGTH(X"80").
           DISPLAY FUNCTION ORD(N) " " FUNCTION ORD(N2).
           STOP RUN.
