       IDENTIFICATION DIVISION.
       PROGRAM-ID. M1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IX ASSIGN TO "m1.idx" ORGANIZATION INDEXED
             ACCESS DYNAMIC RECORD KEY IK FILE STATUS S1.
           SELECT RL ASSIGN TO "m1.rel" ORGANIZATION RELATIVE
             ACCESS DYNAMIC RELATIVE KEY RK FILE STATUS S2.
           SELECT SQ ASSIGN TO "m1.seq" ORGANIZATION SEQUENTIAL
             FILE STATUS S3.
       DATA DIVISION.
       FILE SECTION.
       FD IX RECORD VARYING 5 TO 20 DEPENDING ON L1.
       01 IR. 05 IK PIC X(5). 05 FILLER PIC X(15).
       FD RL RECORD VARYING 5 TO 20 DEPENDING ON L2.
       01 RR PIC X(20).
       FD SQ RECORD VARYING 5 TO 20 DEPENDING ON L3.
       01 SR PIC X(20).
       WORKING-STORAGE SECTION.
       01 S1 PIC XX. 01 S2 PIC XX. 01 S3 PIC XX.
       01 L1 PIC 99 VALUE 2. 01 L2 PIC 99 VALUE 2. 01 L3 PIC 99 VALUE 2.
       01 RK PIC 9(4) VALUE 1.
       PROCEDURE DIVISION.
           MOVE "AAAAA" TO IK
           WRITE IR  DISPLAY "IX notopen+44=" S1
           WRITE RR  DISPLAY "RL notopen+44=" S2
           WRITE SR  DISPLAY "SQ notopen+44=" S3
           OPEN OUTPUT IX RL SQ
           WRITE IR  DISPLAY "IX open+44=" S1
           CLOSE IX RL SQ
           OPEN INPUT IX RL SQ
           WRITE IR  DISPLAY "IX input+44=" S1
           WRITE RR  DISPLAY "RL input+44=" S2
           WRITE SR  DISPLAY "SQ input+44=" S3
           READ SQ AT END CONTINUE END-READ DISPLAY "SQ rd1=" S3
           READ SQ AT END CONTINUE END-READ DISPLAY "SQ rd2=" S3
           CLOSE SQ
           READ SQ AT END CONTINUE END-READ DISPLAY "SQ closed+46=" S3
           STOP RUN.
