       IDENTIFICATION DIVISION.
       PROGRAM-ID. P101.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           CLASS SB AS "System.Text.StringBuilder".
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 O USAGE OBJECT REFERENCE SB.
       PROCEDURE DIVISION.
           INVOKE SB "NEW" RETURNING O.
           DISPLAY "AFTER".
           STOP RUN.
