       IDENTIFICATION DIVISION.
       FUNCTION-ID. EXTF AS "strlen" IS PROTOTYPE.
       DATA DIVISION.
       LINKAGE SECTION.
       01 A PIC X(4).
       01 R PIC 9(4).
       PROCEDURE DIVISION USING A RETURNING R.
       END FUNCTION EXTF.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. P88.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION EXTF.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X(4) VALUE "ABCD".
       01 N PIC 9(4).
       PROCEDURE DIVISION.
           MOVE FUNCTION EXTF(X) TO N.
           DISPLAY "N=" N.
           DISPLAY "EXC=" FUNCTION EXCEPTION-STATUS.
           STOP RUN.
       END PROGRAM P88.
