      >>TURN EC-ALL CHECKING ON
       IDENTIFICATION DIVISION.
       PROGRAM-ID. P99.
       PROCEDURE DIVISION.
           DISPLAY "BEFORE".
           RAISE EXCEPTION EC-IMP-WIBBLE.
           DISPLAY "AFTER1".
           RAISE EXCEPTION EC-PROGRAM-IMP.
           DISPLAY "AFTER2".
           STOP RUN.
