*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPT01.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W PIC X(5).
01 P USAGE POINTER.
PROCEDURE DIVISION.
MAIN.
    ALLOCATE W RETURNING P.
    STOP RUN.
