*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPT06.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W PIC X(5).
01 B REDEFINES W PIC X(5) BASED.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
