*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPT07.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 G.
   05 B PIC X(5) BASED.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
