*> reject-at: 2002 2014 2023
*> ISO 8.8.4.4.3 SR4: ALPHABETIC/ALPHABETIC-LOWER/ALPHABETIC-UPPER/class-name shall not be specified
*> for a boolean operand.
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGNB11.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W-B PIC 1(4) VALUE B"0101".
PROCEDURE DIVISION.
MAIN.
    IF W-B IS ALPHABETIC DISPLAY "A".
    STOP RUN.
