*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGDR01.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "negdr01" ORGANIZATION IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD F
    DATA RECORD IS R.
01 R PIC X(10).
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT F.
    CLOSE F.
    STOP RUN.
