*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGDM01.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. GENERIC-BOX
    WITH DEBUGGING MODE.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
