*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPT04.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W PIC X(5).
PROCEDURE DIVISION.
MAIN.
    FREE W.
    STOP RUN.
