*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGMS01.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. GENERIC-BOX
    MEMORY SIZE 64000 WORDS.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
