*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGMF01.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "negmf01" ORGANIZATION IS SEQUENTIAL.
I-O-CONTROL.
    MULTIPLE FILE TAPE CONTAINS F POSITION 1.
DATA DIVISION.
FILE SECTION.
FD F.
01 R PIC X(10).
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT F.
    CLOSE F.
    STOP RUN.
