*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGOR01.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "negor01" ORGANIZATION IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD F.
01 R PIC X(10).
PROCEDURE DIVISION.
MAIN.
    OPEN INPUT F REVERSED.
    CLOSE F.
    STOP RUN.
