      *> reject-at: 2002 2014 2023
       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEGPB179A.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC X(8).
       01 WS-P REDEFINES WS-A USAGE POINTER.
       PROCEDURE DIVISION.
       MAIN.
           STOP RUN.
