      *> reject-at: 2002 2014 2023
       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEGPB179B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-P USAGE POINTER.
       01 WS-A REDEFINES WS-P PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
           STOP RUN.
