*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPT05.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 P PIC X(4) USAGE POINTER.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
