*> reject-at: 2002 2014 2023
*> ISO 1989:2023 13.16.3 SR8 - the PICTURE clause shall not be specified for an item whose usage is
*> program-pointer (COBOLNET0881).
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPP03.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 PP PIC X(8) USAGE PROGRAM-POINTER.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
