*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGSR4.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "f.dat" ORGANIZATION IS RELATIVE
        ACCESS MODE IS RANDOM RELATIVE KEY IS K
        LOCK MODE IS AUTOMATIC.
DATA DIVISION.
FILE SECTION.
FD F.
01 R PIC X(8).
WORKING-STORAGE SECTION.
01 K PIC 9(4).
PROCEDURE DIVISION.
MAIN.
    MOVE 1 TO K.
    READ F WITH LOCK.
    STOP RUN.
