*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGRR01.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "negrr" ORGANIZATION IS SEQUENTIAL.
I-O-CONTROL.
    RERUN ON F EVERY 10 RECORDS OF F.
DATA DIVISION.
FILE SECTION.
FD F.
01 R PIC X(10).
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT F.
    CLOSE F.
    STOP RUN.
