*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGSL01.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
OBJECT-COMPUTER. GENERIC-BOX
    SEGMENT-LIMIT IS 20.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
