*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGSG01.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W PIC 9 VALUE 5.
PROCEDURE DIVISION.
FIRST-PART SECTION 10.
P1.
    DISPLAY W.
SECOND-HALF SECTION 50.
P2.
    STOP RUN.
