*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGPT03.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W PIC X(5).
01 P USAGE POINTER.
PROCEDURE DIVISION.
MAIN.
    SET ADDRESS OF W TO P.
    STOP RUN.
