*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGSR8.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "f.dat" ORGANIZATION IS SEQUENTIAL
        SHARING WITH ALL OTHER.
DATA DIVISION.
FILE SECTION.
FD F.
01 R PIC X(8).
PROCEDURE DIVISION.
MAIN. STOP RUN.
