*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGSR1.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT S ASSIGN TO "s.dat".
DATA DIVISION.
FILE SECTION.
SD S.
01 SR PIC X(8).
PROCEDURE DIVISION.
MAIN.
    UNLOCK S.
    STOP RUN.
