*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGUD01.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 W PIC 9 VALUE 3.
PROCEDURE DIVISION.
DECLARATIVES.
DBG-SEC SECTION.
    USE FOR DEBUGGING ON ALL PROCEDURES.
DBG-PARA.
    DISPLAY "NEVER-SEEN".
END DECLARATIVES.
MAIN SECTION.
M1.
    DISPLAY W.
    STOP RUN.
