*> reject-at: 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGUW04.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 END-RECEIVE PIC 9 VALUE 4.
PROCEDURE DIVISION.
MAIN.
    DISPLAY END-RECEIVE.
    STOP RUN.
