*> reject-at: 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGUW03.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 RECEIVE PIC 9 VALUE 3.
PROCEDURE DIVISION.
MAIN.
    DISPLAY RECEIVE.
    STOP RUN.
