*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGUW02.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 RAISING PIC 9 VALUE 6.
PROCEDURE DIVISION.
MAIN.
    DISPLAY RAISING.
    STOP RUN.
