*> reject-at: 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGUW01.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 COMMIT PIC 9 VALUE 1.
PROCEDURE DIVISION.
MAIN.
    DISPLAY COMMIT.
    STOP RUN.
