*> reject-at: 2002 2014 2023
IDENTIFICATION DIVISION.
PROGRAM-ID. NEGVO01.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F ASSIGN TO "negvo01" ORGANIZATION IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD F
    VALUE OF RETENTION IS 30.
01 R PIC X(10).
PROCEDURE DIVISION.
MAIN.
    OPEN OUTPUT F.
    CLOSE F.
    STOP RUN.
