       IDENTIFICATION DIVISION.
       PROGRAM-ID. OODEMO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 G USAGE OBJECT REFERENCE GREETER.
       PROCEDURE DIVISION.
       MAIN.
           INVOKE GREETER "NEW" RETURNING G.
           INVOKE G "SAYHELLO".
           STOP RUN.
       END PROGRAM OODEMO.

       IDENTIFICATION DIVISION.
       CLASS-ID. GREETER.
       IDENTIFICATION DIVISION.
       OBJECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MSG PIC X(13) VALUE "HELLO, WORLD!".
       PROCEDURE DIVISION.
       METHOD-ID. SAYHELLO.
       PROCEDURE DIVISION.
       M.
           DISPLAY MSG.
       END METHOD SAYHELLO.
       END OBJECT.
       END CLASS GREETER.
