       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAR-NEG-DYN85.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-TBL.
          05 WS-E PIC 9(3) OCCURS DYNAMIC FROM 1 TO 5.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "X".
           STOP RUN.
