       IDENTIFICATION DIVISION.
       PROGRAM-ID. T8.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GRP.
          05 DT OCCURS DYNAMIC FROM 2 PIC 9(3).
          05 R REDEFINES DT PIC X(6).
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "X".
           STOP RUN.
