       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHAR-CALL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ARG PIC 9(4) VALUE 55.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL "CHAR-SUB" USING BY REFERENCE WS-ARG.
           DISPLAY WS-ARG.
           STOP RUN.
