
                                       OFFICIAL COBOL COMPILER VALIDATION SYSTEM

                                        CCVS85 4.2  COPY - NOT FOR DISTRIBUTION

TEST RESULT OF NC201A    IN  HIGH        LEVEL VALIDATION FOR ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.


 FOR OFFICIAL USE ONLY            COBOL 85 VERSION 4.2, Apr  1993 SSVG                        COPYRIGHT   1985


 FEATURE              PASS  PARAGRAPH-NAME                                                 REMARKS
 TESTED               FAIL

 ***********************************************************************************************************************
 PERFORM UNTIL        PASS  PFM-TEST-F3-1
 PERFORM UNTIL        PASS  PFM-TEST-F3-2
 PERFORM VARYING      PASS  PFM-TEST-F4-1
 PERFORM VARYING      PASS  PFM-TEST-F4-2
 PERFORM VARYING      FAIL* PFM-TEST-F4-3

                                     COMPUTED=  000000015.000000000
                                     CORRECT =  000000015.000000000  VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000020.000000000      000000020.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000025.000000000      000000025.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000030.000000000      000000030.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000035.000000000      000000035.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000040.000000000      000000040.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000045.000000000      000000045.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000050.000000000      000000050.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000026.000000000      000000002.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***         000000001.000000000      000000001.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-3
*** INFORMATION ***        A                        A                   VI-112 6.20.4 GR10(d)

 PERFORM VARYING      FAIL* PFM-TEST-F4-4

                                     COMPUTED=  000000005.000000000
                                     CORRECT =  000000005.000000000  VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000005.000000000      000000005.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000005.700000000      000000005.700000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000006.400000000      000000006.400000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000007.100000000      000000007.100000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000007.800000000      000000007.800000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000008.500000000      000000008.500000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000009.200000000      000000009.200000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000009.900000000      000000009.900000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000007.000000000      000000003.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000000.000000000      000000010.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***         000000006.000000000      000000006.000000000VI-112 6.20.4 GR10(d)

 PERFORM VARYING            PFM-TEST-F4-4
*** INFORMATION ***        B                        B                   VI-112 6.20.4 GR10(d)

 PERFORM VARYING      PASS  PFM-TEST-F3-3
 PERFORM VARYING      PASS  PFM-TEST-F4-5
 PERFORM VARYING      PASS  PFM-TEST-F4-6
 PERFORM VARYING      PASS  PFM-TEST-F4-7
 PERFORM VARYING      PASS  PFM-TEST-F4-8
 PERFORM VARYING      PASS  PFM-TEST-F4-9
 PERFORM VARYING      PASS  PFM-TEST-F4-10
 PERFORM VARYING      PASS  PFM-TEST-F4-11
 PERFORM VARYING      PASS  PFM-TEST-F4-12
 PERFORM VARYING      PASS  PFM-TEST-F3-4
 PERFORM VARYING      PASS  PFM-TEST-F3-5
 PERFORM VARYING      PASS  PFM-TEST-F3-6
 PERFORM VARYING      PASS  PFM-TEST-F3-7
 PERFORM VARYING      PASS  PFM-TEST-F3-8
 PERFORM VARYING      PASS  PFM-TEST-F3-9
 PERFORM VARYING      FAIL* PFM-TEST-F4-13

                                     COMPUTED=  000000015.000000000
                                     CORRECT =  000000015.000000000  VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000020.000000000      000000020.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000025.000000000      000000025.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000030.000000000      000000030.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000035.000000000      000000035.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000040.000000000      000000040.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000045.000000000      000000045.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000050.000000000      000000050.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000026.000000000      000000002.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***         000000001.000000000      000000001.000000000VI-114 6.20.4 GR10(d)1

 PERFORM VARYING            PFM-TEST-F4-13
*** INFORMATION ***        A                        A                   VI-114 6.20.4 GR10(d)1

 PERFORM VARYING      PASS  PFM-TEST-F4-14-1   .01
 PERFORM VARYING      PASS  PFM-TEST-F4-14-2   .02
 PERFORM VARYING      PASS  PFM-TEST-F4-15     .01
 PERFORM VARYING      PASS  PFM-TEST-F4-15     .02
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .01
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .02
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .03
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .04
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .05
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .06
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .07
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .08
 PERFORM VARYING      PASS  PFM-TEST-F4-16     .09
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .01
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .02
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .03
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .04
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .05
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .06
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .07
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .08
 PERFORM VARYING      PASS  PFM-TEST-F4-17     .09
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .01
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .02
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .03
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .04
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .05
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .06
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .07
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .08
 PERFORM VARYING      PASS  PFM-TEST-F4-18     .09
 VARYING BY FRAC.     PASS  PFM-TEST-F4-20                PERFORM VARYING
 CHANGE BY INCR.      PASS  PFM-TEST-F4-21                PERFORM VARYING
 CHANGE BY INCR.      PASS  PFM-TEST-F4-22                PERFORM VARYING
 CHANGE BY INCR.      PASS  PFM-TEST-F4-23
 CHANGE BY INCR.      FAIL* PFM-TEST-F4-24

                                     COMPUTED=  000008224.000000000
                                     CORRECT =  000000080.000000000  VI-112 6.20.4 GR10(d)

 CHANGE BY INCR.      FAIL* PFM-TEST-F4-24

                                     COMPUTED=  000000002.000000000
                                     CORRECT =  000000004.000000000  VI-112 6.20.4 GR10(d)

 ***********************************************************************************************************************




                                                    END OF TEST-  NC201A

                                                    054 OF 059  TESTS WERE EXECUTED SUCCESSFULLY
                                                    005 TEST(S) FAILED
                                                    NO  TEST(S) DELETED
                                                    NO  TEST(S) REQUIRE INSPECTION
 FOR OFFICIAL USE ONLY            ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.                   COPYRIGHT 1985
