
                                       OFFICIAL COBOL COMPILER VALIDATION SYSTEM

                                        CCVS85 4.2  COPY - NOT FOR DISTRIBUTION

TEST RESULT OF SM205A    IN  HIGH        LEVEL VALIDATION FOR ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.


 FOR OFFICIAL USE ONLY            COBOL 85 VERSION 4.2, Apr  1993 SSVG                        COPYRIGHT   1985


 FEATURE              PASS  PARAGRAPH-NAME                                                 REMARKS
 TESTED               FAIL

 ***********************************************************************************************************************
 COPY SD REPLACING    PASS  COPY-TEST-1
 COPY SD REPLACING    PASS  COPY-TEST-2
 COPY SD REPLACING    PASS  COPY-TEST-3
 COPY SD REPLACING    PASS  COPY-TEST-4
 COPY SD REPLACING    PASS  COPY-TEST-5
 COPY SD REPLACING    PASS  COPY-TEST-6
 COPY SD REPLACING    PASS  COPY-TEST-7
 COPY SD REPLACING    PASS  COPY-TEST-8
 COPY SD REPLACING    PASS  COPY-TEST-9
 ***********************************************************************************************************************




                                                    END OF TEST-  SM205A

                                                    009 OF 009  TESTS WERE EXECUTED SUCCESSFULLY
                                                    NO  TEST(S) FAILED
                                                    NO  TEST(S) DELETED
                                                    NO  TEST(S) REQUIRE INSPECTION
 FOR OFFICIAL USE ONLY            ON-SITE VALIDATION, NATIONAL INSTITUTE OF STD & TECH.                   COPYRIGHT 1985
