       IDENTIFICATION DIVISION.
       FUNCTION-ID. FPDBL210.
       DATA DIVISION.
       LINKAGE SECTION.
       01 L-ARG PIC S9(4).
       01 L-RES PIC S9(9).
       PROCEDURE DIVISION USING L-ARG RETURNING L-RES.
           COMPUTE L-RES = L-ARG * 2
           GOBACK.
       END FUNCTION FPDBL210.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FP210PRB.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION FPDBL210.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GFT IS TYPEDEF STRONG.
          05 GA PIC X(3).
          05 GF USAGE FUNCTION-POINTER TO FPDBL210.
          05 GZ PIC X(2).
       01 WS-G TYPE GFT.
       01 WS-DST PIC X(20).
       PROCEDURE DIVISION.
       MAIN.
           MOVE "abc" TO GA OF WS-G
           MOVE "zz" TO GZ OF WS-G
           DISPLAY "N[" WS-G "]"
           SET GF OF WS-G TO ADDRESS OF FUNCTION FPDBL210
           DISPLAY "S[" WS-G "]"
           MOVE WS-G TO WS-DST
           DISPLAY "M{" WS-DST "}"
           DISPLAY FUNCTION LENGTH (WS-G)
           DISPLAY FUNCTION BYTE-LENGTH (GF OF WS-G)
           STOP RUN.
       END PROGRAM FP210PRB.
