       >>DEFINE XMODE AS 2
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CCICOPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY cc_in_copy_data.
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY W-VAL.
           STOP RUN.
