       >>COBOL-WORDS UNDEFINE "MOVE"
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CWUN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MOVETAB.
          05 MOVE PIC 9 OCCURS 3 TIMES.
       PROCEDURE DIVISION.
       MAIN.
           COMPUTE MOVE(2) = 5.
           DISPLAY MOVE(2).
           STOP RUN.
