       >>COBOL-WORDS EQUATE "DISPLAY" WITH "SHOW"
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CWEQ.
       PROCEDURE DIVISION.
       MAIN.
           SHOW "EQUATE WORKS".
           STOP RUN.
