       >>COBOL-WORDS SUBSTITUTE "DISPLAY" BY "SHOW"
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CWSU.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DISPLAY PIC X(9) VALUE "AS-A-NAME".
       PROCEDURE DIVISION.
       MAIN.
           SHOW DISPLAY.
           STOP RUN.
